---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalModel
source: html/09a37241-1e17-e281-e9a1-7e5034025a83.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalModel Property

"Enable Analytical Model"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAnalyticalModel { get; }
```